// มีตัวเลขแล้วที่ขาดไม่ได้คือ ข้อมูลที่เป็นตัวหนังสือ หรือ Text นี่เอง เรามาลองใช้กันง่ายๆ
// ชื่อคือ String ถูกเรียก String เพราะวิธีการสร้าง Text แต่ก่อนคือการเรียงลำดัีบของ Character เป็นเส้นเหมือนกับเส้นเชือก

'hello';
hello; // ไม่รู้จัก เพราะมองว่าเป็นตัวแปร
('Skooldio สตูดิโอของคนอยากอัพสกิล');

// String มี ข้อมูลคุณสมบัติเฉพาะ หรือเรียกกันว่า properties ให้เรียกชื่อว่า length

'Skooldio สตูดิโอของคนอยากอัพสกิล'.length;
// เราสามารถบอกได้ว่า String ตำแหน่งที่เท่าใดเป็นตัวอะไรด้วยการ

'Skooldio สตูดิโอของคนอยากอัพสกิล'[7];

// Escape String // String หนี ผ่าง
'hello \n' + 'Skooldio สตูดิโอของคนอยากอัพสกิล';
('Skooldio\nสตูดิโอของคนอยากอัพสกิล');
('Skooldio "สตูดิโอของคนอยากอัพสกิล');
('Skooldio\\สตูดิโอของคนอยากอัพสกิล"');
("Skooldio 'สตูดิโอของคนอยากอัพสกิล'");
('Skooldio\tสตูดิโอของคนอยากอัพสกิล');
// \ (backslash)
// \"	'' (double quote)
// \'	' (single quote)
// \n	newline
// \t	tab

// String Comparison
// == === != !==
'1' == 1;
1 === '1';

//Link http://www.vias.org/cppcourse/chap07_03.html
